[
  {
    "id": "ppg_act_overcharge",
    "name": "Overcharge (PPG)",
    "activation": "Free",
    "terse": "Overcharging lets you reroll any attack, check, or save once.",
    "detail": "When you OVERCHARGE, you briefly push your mech beyond factory specifications for a tactical advantage. Moments of intense action won’t tax your mech’s systems too much, but sustained action beyond prescribed limits takes a toll.<br>After you make an attack roll, skill check, or save and know the result you can OVERCHARGE your mech, allowing you to reroll the attack roll, skill check, or save once and use the new result. This free action can be taken even when it is not your turn.<br>The first time you OVERCHARGE, take 1 heat.<br>The second time you OVERCHARGE, take 1d3 heat.<br>The third time, take 1d6 heat, and each time thereafter take 1d6+4 heat.<br>You take this heat after the action resolves. A rest reduces this counter by one step; spending 1 repair during a rest completely resets this counter. In addition, a FULL REPAIR resets this counter.",
    "mech": true,
    "pilot": false,
    "synergy_locations": [
      "overcharge"
    ],
    "confirm": [
      "REACTOR LIMITER DISABLED. CORE TEMPERATURES RISING."
    ]
  },
  {
    "id": "ppg_act_search",
    "name": "Search (PPG)",
    "activation": "Quick",
    "terse": "Look for a hidden target.",
    "detail": "When you SEARCH, you attempt to identify hidden characters. To SEARCH in a mech, make a SYSTEMS contested by the AGILITY checks of all HIDDEN characters within SENSORS.<br>To SEARCH as a pilot on foot, make a contested skill check, adding bonuses from triggers as normal. This can be used to reveal characters within RANGE 5.<br>Any HIDDEN character who loses the contested check immediately loses HIDDEN and can be located again by any character.",
    "mech": true,
    "pilot": true,
    "synergy_locations": [
      "search"
    ]
  },
  {
    "id": "ppg_act_brace",
    "name": "Brace (PPG)",
    "activation": "Reaction",
    "terse": "Brace your mech for impact, reducing damage at the cost of your next turn’s actions.",
    "detail": "<p>When you <b><span style='font-variant: small-caps;'>Brace</span></b>, you ready your mech against incoming fire.</p><p>Brace<br>Reaction, 1/scene</p><p>Trigger: You take damage, burn, or heat from a source other than yourself.</p><p>Effect: You gain <b><span style='font-variant: small-caps;'>Resistance</span></b> to all damage, burn, and heat from the triggering source.</p>",
    "mech": true,
    "pilot": false,
    "synergy_locations": [
      "brace"
    ]
  },
  {
    "id": "ppg_act_aid",
    "name": "Aid (PPG)",
    "activation": "Quick",
    "terse": "Aid a mech so it can Stabilize more easily.",
    "detail": "When you <b><span style='font-variant: small-caps;'>Aid</span></b>, you assist a mech so it can <b><span style='font-variant: small-caps;'>Stabilize</span></b> more easily. Choose an adjacent character. On their next turn, they may <b><span style='font-variant: small-caps;'>Stabilize</span></b> as a <b>quick action</b>. They can choose to take this action even if they normally would not be able to take actions (for example, by being affected by the <b><span style='font-variant: small-caps;'>Stunned</span></b> condition).",
    "mech": true,
    "pilot": false
  },
  {
    "id": "ppg_act_handle",
    "name": "Handle",
    "activation": "Quick",
    "terse": "Lift or drag an object.",
    "detail": "As a <b>protocol</b> or <b>quick action</b>, a character may start to handle an adjacent object or willing character by lifting or dragging them. A character may choose to stop handling an object as a free action.<br/><br/>Mechs can drag characters or objects up to twice their SIZE but are SLOWED while doing so. They can also lift characters or objects of equal or lesser SIZE overhead but are IMMOBILIZED while doing so. While dragging or lifting, characters can’t take reactions. The same rules apply to pilots and other characters on foot, but they can’t drag or lift anything above SIZE 1/2.<br/><br/>If a character starts to handle an object handled by a hostile character, the object does not move until it is only handled by characters allied with each other. If a character handling an object is involuntarily moved such that they are no longer adjacent to the object, they cease to handle the object. As a quick action, a handler may roll a single HULL check. All hostile handlers must succeed on a contested HULL check or cease to handle the object.",
    "mech": true,
    "pilot": true
  },
  {
    "id": "ppg_act_interact",
    "name": "Interact",
    "activation": "Quick",
    "terse": "Manipulate a nearby object.",
    "detail": "<p>When you <b><span style='font-variant: small-caps;'>Interact</span></b>, you manipulate an object in some way, such as pushing a button, knocking it over, or ripping out wires. You may only <b><span style='font-variant: small-caps;'>Interact</span></b> <b>1/turn</b>, regardless of whether it is used as a <b>protocol</b> or <b>quick action</b>.</p><p>If there are no hostile characters adjacent to the object when you <b><span style='font-variant: small-caps;'>Interact</span></b> with it, you automatically succeed. If there is at least one hostile character adjacent to the object, you must succeed on a contested <b>skill check</b> in order to <b><span style='font-variant: small-caps;'>Interact</span></b> with the object. The skill check is context-dependent. For example, you may attempt to reset a computer with a <b><span style='font-variant: small-caps;'>Systems</span></b> check while an opponent is roughhousing you with a <b><span style='font-variant: small-caps;'>Hull</span></b> check. Pilot <b>skill triggers</b> may be used in place of <b>mech skills</b> when the context is appropriate.</p>",
    "mech": true,
    "pilot": true
  },
  {
    "id": "ppg_act_drop_prone",
    "name": "Drop Prone",
    "activation": "Free",
    "terse": "Drop <b><span style='font-variant: small-caps;'>Prone</span></b>, landing if flying.",
    "detail": "1/turn, a character may <b><span style='font-variant: small-caps;'>Drop Prone</span></b> as a <b>free action</b>, gaining the <b><span style='font-variant: small-caps;'>Prone</span></b> status. If the character is flying and is not underwater, in zero-g, or in a similar environment, they immediately land (this counts as falling without damage) before falling <b><span style='font-variant: small-caps;'>Prone</span></b>.",
    "mech": true,
    "pilot": true
  },
  {
    "id": "ppg_act_squeeze",
    "name": "Squeeze",
    "activation": "Free",
    "terse": "Fit into a smaller space than usual.",
    "detail": "A character may <b>squeeze</b> as a <b>free action</b>, treating themselves as one <b><span style='font-variant: small-caps;'>Size</span></b> smaller for the purposes of movement. While <b>squeezing</b>, the character is additionally treated as <b><span style='font-variant: small-caps;'>Prone</span></b>. The character may stop squeezing as a <b>free action</b> while in a space able to accommodate their normal <b><span style='font-variant: small-caps;'>Size</span></b>.",
    "mech": true,
    "pilot": true
  }
]